package ch01_변수와자료형;

public class 식별자규칙 {

	/**
	 * 자바는 대소문자를 구분한다. 따라서 Num1 과 num1은 서로 다른 이름으로 인식된다. 
	 * 때문에 자료형 in를 대신하여 INT를 사용할 수 없다. 그리고 변수의 이름을 짓는데 다음과 같은 제약사항이 존재한다.
	 * 
	 * 식별자 규칙
	 * 1. 첫 문자가 문자나 '_', '$'의 특수문자로 시작되어야 한다. 숫자로 시작할 수 없다.
	 * 2. 첫 문자가 아니라면, 문자나 '_', '$'의 특수문자 그리고 숫자로 구성될 수 있다.
	 * 3. 자바의 예약어는 식별자로 사용할 수 없다.
	 * 4. 자바의 식별자는 대소문자를 구분한다.
	 * 5. 식별자 길이는 제한이 없고 공백은 포함할 수 없다.
	 * 
	 * 일반적 관례
	 * - 클래스 이름은 대문자의 명사로 시작
	 * - 메서드 이름은 소문자의 동사
	 * - 변수는 소문자의 명사
	 * - 상수는 대문자의 명사
	 * 
	 */
}
